print("มีเงินอยู่ 1000 บาท ")
print("ต้องการซื้อสินค้า:หมูสับกิโล=150,เนื้ออกไก่=105,ไก่บ้าน(ตัว)=120,ผงทำต้มยำ= 6.50,ข้าวสาร=150,น้ำตาล=20,ปลากระป๋องสามแม่ครัว= 10,ซอสแม็กกี้ขวดเล็ก=18,ยางรัด=10.25,ไข่แผงคละเบอร์=120.25,ชานมเย็น=21.50,Pepsi=29.50,กาแฟ=15,นมพาสเจอไรส์= 19,ชาไทย=11.50,น้ำเปล่า=15.15,น้ำแข็ง= 10")
money=1000

หมูสับกิโล=150
เนื้ออกไก่=105
ไก่บ้าน=120
ผงทำต้มยำ= 6.50
ข้าวสาร=150
น้ำตาล=20
ปลากระป๋องสามแม่ครัว= 10
ซอสแม็กกี้ขวดเล็ก=18
ยางรัด=10.25
ไข่แผงคละเบอร์=120.25
ชานมเย็น=21.50
Pepsi=29.50
กาแฟ=15
นมพาสเจอไรส์= 19
ชาไทย=11.50
น้ำเปล่า=15.15
น้ำแข็ง= 10

price=(หมูสับกิโล+เนื้ออกไก่+ไก่บ้าน+ผงทำต้มยำ+ข้าวสาร+น้ำตาล+ปลากระป๋องสามแม่ครัว+ซอสแม็กกี้ขวดเล็ก+ยางรัด+ไข่แผงคละเบอร์+ชานมเย็น+Pepsi+กาแฟ+นมพาสเจอไรส์+ชาไทย+น้ำเปล่า+น้ำแข็ง)

print("ราคาสินค้าทั้งหมด",price,"บาท")

torn=(money-price)
print("เงินทอน",torn,"บาท")
